string definition_of_the_theorem = "Изоморфизм — отношение эквивалентности на множестве графов G, т. е. оно рефлексивно, " +
    "симметрично, транзитивно.";

string proof = "Доказательство теоремы основано на том, что:" +
    "\nа) тождественное отображение биективно." +
    "\nб) биективные отображения обратимы и обратные к ним биективны." +
    "\nв) композиция биективных отображений биективна.";

Console.WriteLine($"Теорема: {definition_of_the_theorem}\n");
Console.WriteLine($"Доказательство: {proof}");

Я сломал код :)
    Тригеры были неправильно настроены, пришлось ещё раз сломать сломанный код ::))